# Input and Output

In [ ]:
import pandas as pd

In [ ]:
url = 'https://data.cityofnewyork.us/api/views/25th-nujf/rows.csv'
baby_names = pd.read_csv(url)
baby_names

## Export DataFrame to CSV File
- The `to_csv` method exports a **DataFrame** to a CSV file.
- Its first argument is the filename.
- By default, pandas will include the index. Set the `index` parameter to False to exclude the index.
- The `columns` parameter limits the exported columns.

In [ ]:
baby_names.to_csv('baby_names.csv')

In [ ]:
baby_names.to_csv('baby_names.csv', index=False)

In [ ]:
baby_names.to_csv('baby_names.csv', index=False, columns=['Year of Birth', 'Gender', 'Child\'s First Name'])

## Install openpyxl Library to Read and Write Excel Files

## Import Excel File into pandas
- The `read_excel` function reads an Excel file/workbook into a **DataFrame**.
- Use the `sheet_name` parameter if the workbook contains multiple worksheets. Pass a single worksheet name or a list of worksheet names/index positions.
- Pass the `sheet_name` parameter an argument of **None** to include all worksheets.
- Pandas will store multiple worksheets in a Python dictionary. The keys will be the worksheet names, and the values will be the **DataFrames**.

In [ ]:
pd.read_excel('Data - Single Worksheet.xlsx')

In [ ]:
pd.read_excel('Data - Multiple Worksheets.xlsx')

In [ ]:
pd.read_excel('Data - Multiple Worksheets.xlsx', sheet_name='Data 1')

In [ ]:
pd.read_excel('Data - Multiple Worksheets.xlsx', sheet_name='Data 2')

In [ ]:
pd.read_excel('Data - Multiple Worksheets.xlsx', sheet_name=0)

In [ ]:
pd.read_excel('Data - Multiple Worksheets.xlsx', sheet_name=1)

In [ ]:
pd.read_excel('Data - Multiple Worksheets.xlsx', sheet_name=['Data 1', 'Data 2'])

In [ ]:
pd.read_excel('Data - Multiple Worksheets.xlsx', sheet_name=[0, 1])

In [ ]:
pd.read_excel('Data - Multiple Worksheets.xlsx', sheet_name=None)

In [ ]:
data = pd.read_excel('Data - Multiple Worksheets.xlsx', sheet_name=None)
data

In [ ]:
data['Data 1']

In [ ]:
data['Data 2']

## Export Excel File from pandas
- The **ExcelWriter** class writes one or more **DataFrames** to an Excel file.
- Use a context manager (the `with` keyword) in combination with the **ExcelWriter** object and an assigned variable.
- Invoke the `to_excel` method on every **DataFrame** to include in the Excel workbook and pass in the **ExcelWriter** object as the first argument.
- The `to_excel` method supports `sheet_name`, `index`, and `columns` parameters.

In [24]:
url = 'https://data.cityofnewyork.us/api/views/25th-nujf/rows.csv'
baby_names = pd.read_csv(url)
baby_names

,Year of Birth,Gender,Ethnicity,Child's First Name,Count,Rank
0,2011,FEMALE,HISPANIC,GERALDINE,13,75
1,2011,FEMALE,HISPANIC,GIA,21,67
2,2011,FEMALE,HISPANIC,GIANNA,49,42
3,2011,FEMALE,HISPANIC,GISELLE,38,51
4,2011,FEMALE,HISPANIC,GRACE,36,53
...,...,...,...,...,...,...
69209,2012,MALE,BLACK NON HISP,CAYDEN,19,52
69210,2013,FEMALE,WHITE NON HISPANIC,Margaret,25,67
69211,2013,FEMALE,WHITE NON HISPANIC,Tamar,10,82
69212,2013,FEMALE,WHITE NON HISPANIC,Amanda,13,79
69213,2012,FEMALE,HISPANIC,ANNA,10,79

In [25]:
males = baby_names[baby_names['Gender'] == 'MALE']
males

,Year of Birth,Gender,Ethnicity,Child's First Name,Count,Rank
363,2013,MALE,HISPANIC,Jared,25,80
416,2013,MALE,HISPANIC,Jariel,25,80
547,2011,MALE,ASIAN AND PACIFIC ISLANDER,AARAV,15,51
548,2011,MALE,ASIAN AND PACIFIC ISLANDER,AARON,51,19
549,2011,MALE,ASIAN AND PACIFIC ISLANDER,ABDUL,20,46
...,...,...,...,...,...,...
69200,2011,MALE,HISPANIC,ANDERSON,33,71
69204,2011,MALE,HISPANIC,GERARDO,12,92
69206,2013,MALE,BLACK NON HISPANIC,Derrick,10,62
69208,2011,MALE,ASIAN AND PACIFIC ISLANDER,IBRAHIM,17,49
69209,2012,MALE,BLACK NON HISP,CAYDEN,19,52

In [26]:
females = baby_names[baby_names['Gender'] == 'FEMALE']
females

,Year of Birth,Gender,Ethnicity,Child's First Name,Count,Rank
0,2011,FEMALE,HISPANIC,GERALDINE,13,75
1,2011,FEMALE,HISPANIC,GIA,21,67
2,2011,FEMALE,HISPANIC,GIANNA,49,42
3,2011,FEMALE,HISPANIC,GISELLE,38,51
4,2011,FEMALE,HISPANIC,GRACE,36,53
...,...,...,...,...,...,...
69207,2013,FEMALE,HISPANIC,Julia,23,65
69210,2013,FEMALE,WHITE NON HISPANIC,Margaret,25,67
69211,2013,FEMALE,WHITE NON HISPANIC,Tamar,10,82
69212,2013,FEMALE,WHITE NON HISPANIC,Amanda,13,79
69213,2012,FEMALE,HISPANIC,ANNA,10,79

In [27]:
with pd.ExcelWriter('Data - Baby Names.xlsx') as excel_file:
    males.to_excel(excel_file, index=False)
    females.to_excel(excel_file, index=False)

In [30]:
males.to_excel('Data - Males.xlsx', index=False)
females.to_excel('Data - Females.xlsx', index=False)